[
  {
    "签号": 1,
    "福祸宫位": "上签子宫",
    "诗意": "此卦盘古初开寰宇之象，诸事皆吉也。",
    "解曰": "立时兆速年未值时观音降笔先报君知",
    "仙机": "家宅祈福自身秋冬大利求财秋冬大利交易成婚姻成六甲生男行人至田蚕好六畜好寻人见公讼吉移徙掉物西南疾病殁送山坟吉",
    "典故": "钟离成道。东汉时人姓锺离。名权字云房。号正阳。陕西西安咸阳县，仕汉将军，每一收兵俱爲先锋至五十岁免不上杀人三十余万。北征吐番。兵二万。嬴弱士卒。利绝散。独骑逃至山谷。胡僧引进终南山凝阳洞。人生荣辱上掉。往官修道。东华帝君授仙法。遂隐晋州羊角山。汉武帝时。次礼聘不出。朝廷每一有大事。去征询。称山中宰相。吕洞宾之师。八仙之首。正阳派之开山祖师。称爲正阳帝君。后皇帝封爲太极阁下宫真人。",
    "运势": "大吉"
  },
  {
    "签号": 2,
    "福祸宫位": "下签子宫",
    "诗意": "此卦鲸鱼未变之象，凡事忍受待时也。",
    "解曰": "上忍且忍上耐且耐须待时至功名还在",
    "仙机": "家宅不安自身还愿求财欠利交易婚姻难六甲作福行人以及平田蚕吉六畜倒楣寻人见公讼以及移徙往掉物西北疾病祈保山坟吉",
    "典故": "苏秦。战国东周洛阳人。师鬼谷子。游说秦王。书十二上其说。弗成。裘敝金绝。干瘦而回。至家妻不下(织)机。(不分解其夫)嫂不爲炊。(不煮饭给其叔)秦惭怒。上太公阴符。勤苦苦读。困怠时用锥刺股。痛而再读。后以合从(纵)之说。联六国抗秦。说赵竟佩六国相印。",
    "运势": "小凶"
  },
  {
    "签号": 3,
    "福祸宫位": "下签子宫",
    "诗意": "此卦燕子衔坭之象，凡事劳心费劲也。",
    "解曰": "各样用计晨昏不息谁知此事终于功能劳心",
    "仙机": "家宅先凶后吉自身谨防求财有疾病还愿婚姻辨别六甲男行人吉蚕畜利寻人见公讼有理移徙安掉物见交易成山坟吉",
    "典故": "董永遇仙。汉。董永。千乘人。少掉母。独养父。流寓孝感。父亡无以葬。乃从人贷钱一万。之后无钱还。当以身作奴。葬毕。皇天见其孝行。即差仙女下凡爲婚。董永道遇一妇人。求爲永妻。永与俱诘。钱主令织缣(锦)三百疋以偿。一月而毕。辞永往。乃曰。我系天上织女。缘君至孝。玉帝令我助君偿债。言讫。凌空而往。敕封入宝状元。仙姬曰。天赐儿子三岁回还。(仙女弃世)。后其子十六岁中状元。违井离乡。",
    "运势": "小凶"
  },
  {
    "签号": 4,
    "福祸宫位": "上签子宫",
    "诗意": "此卦古镜重圆之象，凡事劳心有贵也。",
    "解曰": "淘沙见金骑龙踏虎虽是劳心于中有补",
    "仙机": "家宅欠利自身秋冬旺求财秋冬旺交易允婚姻成六甲祈保行人至田蚕可养六畜可养寻人见公讼倒楣移徙守旧掉物迟见疾病祈福山坟吉",
    "典故": "玉莲会十朋。荆录记。宋朝。王十朋少时家贫，与钱玉莲成亲。十朋上京赴考。孙汝权逼玉莲相嫁。玉莲投河他杀得救。十朋中状元。拒娶丞相之女爲妻。二人几经挫折。夫妻始复团聚。",
    "运势": "大吉"
  },
  {
    "签号": 5,
    "福祸宫位": "中签丑宫",
    "诗意": "此卦锥地求泉之象，凡事先难后易也。",
    "解曰": "愿看心事东方可求不如莫动登时可谋",
    "仙机": "家宅祈福自身利求财利交易合婚姻合六甲安行人迟田蚕宜早种六畜损寻人见公讼宜以及移徙吉掉物不见疾病禳星山坟吉",
    "典故": "刘晨遇仙。东汉永闰年间。刘晨以及阮肇国二人进晒台山采药。遇二仙女。招至成婚。半年后二人归家。方知子孙已经过七世了，时已经过百年。无人瞅法二人。二人返山找仙女。终找不到原路。喻成心花开花不发。无心偶尔插柳柳成荫。",
    "运势": "中吉"
  },
  {
    "签号": 6,
    "福祸宫位": "中签丑宫",
    "诗意": "此卦投岩铜(雕)鸟之象，凡事务顺吉之兆。",
    "解曰": "食用有余身清喜贫待时利乐权与概人",
    "仙机": "家宅倒楣自身中吉求财中吉交易难婚姻清淡六甲安行人近田蚕早种六畜损寻人见移徙吉掉物见疾病殁送公讼有理山坟吉",
    "典故": "仁贵遇主。唐朝。薛仁贵三次投军。不掉意。只任庖丁。干戈有功也被他人冒领。唐太宗(李世民)被盖苏追杀。危殆当中。上仁贵救。即被唐太宗封爲元帅。后爲征东大将军带兵东征。累立战功。",
    "运势": "中吉"
  },
  {
    "签号": 7,
    "福祸宫位": "下签丑宫",
    "诗意": "此卦拖坭带水之象，凡事守旧则吉也。",
    "解曰": "退身可上前入爲难只宜守旧莫看高扳",
    "仙机": "家宅倒楣自身祈福求财秋冬吉交易清淡婚姻祈福六甲祈福行人阻田蚕倒楣六畜倒楣寻人难公讼亏移徙吉掉物不见疾病作福山坟倒楣",
    "典故": "苏娘走难。周朝景王时。皇后苏英。善与鹦鹉对话。获帝歌颂.西宫梅玉春妒嫉，谗谄苏英。潘葛之妻代后伏诛。娘娘逃至白马寺。腹痛产下太子。喻谁无顺境。随遇而安可也。",
    "运势": "小凶"
  },
  {
    "签号": 8,
    "福祸宫位": "上签丑宫",
    "诗意": "此卦此卦松柏茂林之象，凡事有贵气也。",
    "解曰": "路上利市终生有功田蚕丰熟家境畅旺",
    "仙机": "家宅吉自身顺利求财中平交易旺婚姻成六甲男行人有信田蚕利六畜损寻人至公讼有理移徙吉掉物见疾病安山坟吉",
    "典故": "斐度还带。斐度是唐朝宪宗皇帝的宰相，在大哥时，斐度家景清穷困难。一日到喷鼻山寺拜佛，在地上拾到无价之宝的玉带数条，寻访物主，终上出借。以此积善，反上高官厚禄，贫贱繁荣。后登科入士，任宰相，督师破蔡州，平潍西。老岁尾岁尾年往官居洛阳。",
    "运势": "大吉"
  },
  {
    "签号": 9,
    "福祸宫位": "中签寅宫",
    "诗意": "此卦皎月当空之象，凡事黑暗知晓也。",
    "解曰": "心中正大理顺法宽圣无耳语终有明白较着",
    "仙机": "家宅吉自身顺求财中平交易旺婚姻成六甲男行人动田蚕利六畜损寻人至公讼有理移徙掉物祈福疾病安山坟吉",
    "典故": "孔明点将。三国时。诸葛亮。字孔明。琅琊人。汉末避居南阳。研究奇门遁法。地理术数。卦算韬略。无所不精。刘备三顾草庐。出任军师。曹操大将夏侯敦领兵来攻。孔明升帐。调兵点将。关公张飞都不钦佩。在博看坡击败曹军。刘备队伍大获全胜，关张此后敬仰。先主登位。拜丞相。受以托孤。后主封爲武卿侯。卒谥忠武。",
    "运势": "中吉"
  },
  {
    "签号": 10,
    "福祸宫位": "中签寅宫",
    "诗意": "此卦持灯觅火之象，凡事待时效果也。",
    "解曰": "姻缘会遇何事不可须有限意面前目今是真",
    "仙机": "家宅欠利自身安求财难交易难婚姻合六甲女行人动田蚕秋吉六畜难养寻人见公讼亏移徙旧安掉物难见疾病殁送山坟中平",
    "典故": "庞涓观阵。战国。孙膑齐人。庞涓魏人。同师事鬼谷子。孙膑之学优于庞涓。涓爲魏将。与膑斗智。输而忌之。乃以计刖其足。后孙膑假作颠狂。上脱回。齐威王以膑爲师。将兵伐魏。庞涓至营地观阵。认上是孙膑颠倒八门阵。但破不了。孙膑用减灶添兵之法。赚庞涓。追至马陵道。伏弩射作古。",
    "运势": "中吉"
  },
  {
    "签号": 11,
    "福祸宫位": "上签寅宫",
    "诗意": "此卦因祸上福之象，凡事营谋吉利也。",
    "解曰": "专心兴变终于功能平安若问用事只近贵人",
    "仙机": "家宅大吉自身顺利求财有交易成婚姻合六甲男行人未至田蚕中平六畜中平寻人见公讼有理移徙旺掉物西方疾病禳星山坟吉",
    "典故": "三国时。姜维原为魏国战将。被孔明收服。姜维大智大勇。上孔明注重。孔明带兵六出祁山。病重命危。将己所著兵书二十四篇。计十万四千一百一十二字。内有八务七戒六恐五惧之法教授给大将军姜维。看其承继遗志。",
    "运势": "上吉"
  },
  {
    "签号": 12,
    "福祸宫位": "上签寅宫",
    "诗意": "此卦祸中有福之象，凡事先凶后吉也。",
    "解曰": "换麻上丝击人双足要见明白较着因灾上福",
    "仙机": "家宅安自身吉求财有交易宜迟婚姻成六甲男行人未归田蚕利六畜慎吉寻人有信公讼吉移徙守掉物见疾病秋吉山坟吉",
    "典故": "武吉遇师。武吉本是樵夫。姜子牙钓于磻溪。二人相遇。见子牙用直钩钓鱼大笑。子牙瞅武吉气味断曰。往日进城打作昔人。武吉怒别。担柴进城。误触王相致作古。文王画地为牢。武吉后被暂释。赐顾帮衬老母至秋后处作古。老母令其找姜子牙求救。太公收其为徒。授兵法。又令其挖坑施咒破解后天数。秋后不见武吉伏刑。文王演后天数。以为武吉已经畏罪他杀。后文王碰见武吉。武吉引文王见姜太公。受封武德将军。师徒二人为文王效能。",
    "运势": "上吉"
  },
  {
    "签号": 13,
    "福祸宫位": "中签寅宫",
    "诗意": "此卦龙门上遇之象，凡事有变大吉也。",
    "解曰": "囚人逢赦病即平安龙门上遇名遍皇都",
    "仙机": "家宅祈福自身祈福求财冬吉交易宜迟婚姻合六甲女行人祈保田蚕中平六畜中平寻人见公讼有理移徙守旧掉物西方疾病安山坟吉",
    "典故": "罗通拜帅：唐初。罗通十七岁。于校场交手获帅印。领兵北伐扫敌。后触怒唐太宗被免官。获程咬金讨情上宽赦。喻少年掉意。有针言曰。罗通扫北。",
    "运势": "中吉"
  },
  {
    "签号": 14,
    "福祸宫位": "中签卯宫",
    "诗意": "此卦仙鹤离笼之象，凡事先凶后吉也。",
    "解曰": "绝兴无虑路有益市为所欲为自在如人",
    "仙机": "家宅不安自身还愿求财合交易合婚姻合六甲男行人见田蚕秋利六畜损寻人阻公讼宜以及移徙吉掉物西北疾病殁送山坟吉",
    "典故": "子牙弃官。(封神传)商朝纣王时。姜子牙。一无所成。样样掉败。时已经七十二岁。火烧琵琶精后。获司天监职。官拜下大夫。纣王建鹿台。子牙谏王免劳民伤财。不果。逃归宋异人庄(宋家庄)上。欲与妻马氏离朝歌(首府)去西岐(文王首府)。其妻不肯。子牙写了休书。伶仃去西岐往。在渭水钓鱼。期待机缘。",
    "运势": "中吉"
  },
  {
    "签号": 15,
    "福祸宫位": "中签卯宫",
    "诗意": "此卦鸟鹊离林之象，凡事终于功能应心也。",
    "解曰": "若人以及怨什么时光可伸好言不信守旧待时",
    "仙机": "家宅先凶后吉自身谨防求财吉交易成婚姻障碍六甲男行人顺田蚕旺六畜旺寻人见公讼有理移徙遥可掉物难见疾病还愿山坟吉",
    "典故": "苏秦掉意。战国。苏秦。洛阳人。师鬼谷子。游说秦王。书十二上其说。弗成。裘敝金绝。干瘦而回。至家妻不下织机(不分解其夫)。嫂不为炊(不煮饭给其叔)。秦惭怒。上太公阴符。勤苦苦读。困怠时用锥刺股。痛而再读。再出谋事。以合从(合纵)之说。联六国抗秦。说赵竟佩六国相印。",
    "运势": "中吉"
  },
  {
    "签号": 16,
    "福祸宫位": "中签卯宫",
    "诗意": "此卦阴阳以及合之象，凡所谋皆吉也。",
    "解曰": "上处无掉损中无益君子逢凶小人顺吉",
    "仙机": "家宅倒楣自身秋冬吉求财成交易成婚姻成六甲虚惊行人至田蚕祈福六畜平寻人见公讼倒楣移徙守旧掉物阻疾病作福山坟安",
    "典故": "叶梦熊朝帝。明朝。叶梦熊嘉靖年入士。爲人有胆识。忠贞爱国。万历年间。要地本地地带有寇反水。可未有将领敢前去平乱。叶上朝晋见神宗皇帝。求领兵挞伐边寇。爲国效能。",
    "运势": "吉"
  },
  {
    "签号": 17,
    "福祸宫位": "中签卯宫",
    "诗意": "此卦望梅止渴之象，诸事多虚少实也。",
    "解曰": "心中不定枉瞅经文好像如同画饼食也难吞",
    "仙机": "家宅祈福自身顺利求财顺利交易慢婚姻阻六甲安行人迟田蚕宜早六畜倒楣寻人见公讼宜以及移徙守旧掉物不见疾病还愿山坟吉",
    "典故": "话梅止渴。三国。曹操领兵。败季缺水。兵卒口渴。曹曰前有一默林。到那当可吃梅解渴。兵卒听了口水直流。便不感想熏染口渴。画饼充饥出此典故。与望梅止渴同一意。",
    "运势": "平"
  },
  {
    "签号": 18,
    "福祸宫位": "上签卯宫",
    "诗意": "此卦阴阳消长之象，凡事遂意之兆也。",
    "解曰": "心中无事所作有功如弓上箭一发当空",
    "仙机": "家宅安自身吉求财顺交易成婚姻合六甲男行人至田蚕早种六畜欠利寻人至公讼有理移徙吉掉物迟见疾病拜送（兔年或者属兔凶）山坟大吉",
    "典故": "曹国舅爲仙。八仙之一。宋朝曹太后之弟。不守王法。后感羞辱。因而散绝家财。周济穷汉，进终南山修道。遇钟离权及吕洞宾。引进仙班。手持玉箫爲其标记。",
    "运势": "上吉"
  },
  {
    "签号": 19,
    "福祸宫位": "中签辰宫",
    "诗意": "此卦舟行急滩之象，凡事守旧待时也。",
    "解曰": "急水下舟险处待时若问营谋绝可施爲",
    "仙机": "家宅作福自身作福求财未成交易未成婚姻不就六甲虚惊行人至田蚕吉六畜损寻人难公讼以及移徙守旧掉物难寻疾病祈福山坟吉",
    "典故": "子仪封王。子仪唐朝大将军。以及平禄山以及史思明之乱。历七帝。唐肃宗拜爲大元帅。封爲汾阳郡王。刚八十岁。知有敌入击。郭子仪即披挂上阵。建中二年郭子仪八十五岁因病寿终正寝。",
    "运势": "平"
  },
  {
    "签号": 20,
    "福祸宫位": "中签辰宫",
    "诗意": "此卦久雨初明之象，凡事遂意也。",
    "解曰": "神佛护持有灾无危途生以及平终于功能荣回",
    "仙机": "家宅中平自身祈福求财未遇交易待时婚姻随意六甲女行人阻田蚕阻六畜阻寻人迟公讼以及移徙吉掉物见疾病禳星山坟旧吉",
    "典故": "姜太公遇文王。周。姜尚。字子牙。汲人(东海许州人)。道号飞熊。先世封于吕。亦曰吕看。避纣乱居东海之滨。钓于磻溪(渭水)。其钩爲直。意不在鱼。志在君相。文王闻其贤。聘爲师(丞相)(那时年八十)。后周伐纣。灭商兴周。武王称曰尚父。封其子丁公于齐。",
    "运势": "吉"
  },
  {
    "签号": 21,
    "福祸宫位": "上签辰宫",
    "诗意": "此卦阴阳道合之象，凡事以及合大吉也。",
    "解曰": "谋看从心婚姻孕男资财入益更利田蚕",
    "仙机": "家宅安自身利求财有交易成婚姻合六甲男行人至田蚕兴六畜兴寻人见公讼有理移徙隆盛掉物上见疾病遇良方山坟大吉",
    "典故": "李旦龙凤合营。李旦爲唐睿宗。武则天登基。皇帝贬作平民。流落乡间。巧与胡凤姣相遇。结爲佳耦。民间传说他们二人手上各有半个从胎带取出的方印。经斗印证明他们能合一。龙指睿宗。喻婚姻由天也。",
    "运势": "大吉"
  },
  {
    "签号": 22,
    "福祸宫位": "中签巳宫",
    "诗意": "此卦旱逢甘雨之象，凡事难中有救也。",
    "解曰": "田蚕倍熟命运渐来病遇良药行人便归",
    "仙机": "家宅祈保自身安求财很有交易迟婚姻合六甲女行人有阻田蚕利六畜利寻人难公讼亏移徙守旧掉物东方疾病殁送山坟安吉",
    "典故": "六郎逢救。杨延昭爲杨业之六子。称六郎。杨业统率三军。被异邦困绕。杨业头撞李陵碑而亡。杨七郎请救兵被箭射作古。六郎撤离至葫芦谷。上五台山以及尚(杨五郎)相救出险。喻及时雨也。",
    "运势": "吉"
  },
  {
    "签号": 23,
    "福祸宫位": "中签巳宫",
    "诗意": "此卦手扳仙桂之象，凡事必有贵人也。",
    "解曰": "商贾所长行躲有危病安讼遂绝可施爲",
    "仙机": "家宅欠安自身作福求财遂意交易合婚姻阻六甲作福行人有危田蚕倒楣六畜倒楣寻人难公讼亏移徙欠吉疾病安山坟旧吉",
    "典故": "怀德招亲。高怀德乃北宋开国监犯。陈桥兵变。皇袍加身。高怀德拥赵匡胤做皇帝。又娶宋太祖赵匡胤之妹。燕国公主爲妻。官封驸马都尉。后领兵与杨家将同征辽国。",
    "运势": "中吉"
  },
  {
    "签号": 24,
    "福祸宫位": "下签巳宫",
    "诗意": "此卦白痴道塞之象，凡事守旧待时也。",
    "解曰": "黑白莫说必需详实心正理直方免灾危",
    "仙机": "家宅不安自身险求财阻交易难婚姻待时六甲祈福行人阻田蚕多灾六畜多灾寻人阻公讼亏移徙吉掉物难见疾病急求神山坟不吉",
    "典故": "殷郊遇师。(封神榜)殷郊是商朝纣王之子。拜广成子爲师。三年后学上神通。下山时曾经向广成子宣誓。不帮纣王干好事。要助周文王。然而。在投靠文王的半途中。受人嗾使归家副手纣王。师父去劝。师徒大打着手。后姜子牙合燃灯道人。把殷郊夹于两山之间。被广成子铲作古。以应其誓。",
    "运势": "凶"
  },
  {
    "签号": 25,
    "福祸宫位": "中签巳宫",
    "诗意": "此卦古井逢泉之象，凡事贵人效果也。",
    "解曰": "讼终有理病上安适入出求谋古井逢泉",
    "仙机": "家宅清淡自身障碍求财障碍交易障碍婚姻以及合六甲有险行人隔尽田蚕倒楣六畜倒楣寻人隔尽公讼有理移徙辨别掉物难寻疾病祈福山坟不安",
    "典故": "李广机智。李广是汉代的武将。大胆善战善于骑箭。汉文帝时。李广领军攻击匈奴。经过一场凶悍的战斗。李广的人马被打散，李广也受了轻伤，被匈奴兵俘虏。匈奴兵把他放在两匹马驮着绳子织成的吊床里。想把他送到单于的大营往。李广躺在那张吊床上动也不动，真的像作古了似的。大约走了十几里地，他望准摆布一个匈奴兵骑的一匹好马。使劲一挣扎，猛地跳下马夺了弓箭。把那匈奴兵推上马往。调过马头拼命去南飞奔。匈奴派了几百名骑兵追赶。李广一壁催马快跑。一壁反转铺转身来。拈弓搭箭。陆续射作古了几个追在违面的匈奴兵。匈奴兵只好瞪着白眼让他跑了。李广最终脱了险。李广虽遇险。因他损兵折将，被判死刑。汉朝有一条耿直，监犯可以拿钱赎罪。李广缴了一笔钱赎了罪，归家做了平民。过了不久，匈奴又在边疆骚扰，汉武帝从新起用李广，累坠负责右北平郡（辽宁凌源东北）太守。这是后话。",
    "运势": "中吉"
  },
  {
    "签号": 26,
    "福祸宫位": "中签巳宫",
    "诗意": "此卦坏话之象，凡事虚几何实宜守旧也。",
    "解曰": "高低心烦求闲不闲愿看功名守旧上安",
    "仙机": "家宅祈福自身安求财阻交易不可婚姻不可六甲女行人有信田蚕半熟六畜可养寻人东方公讼亏移徙守旧掉物难寻疾病祈保山坟吉",
    "典故": "钟馗上道。姓钟名馗。字正南。中南蓬菖人氏。唐时人。上京赴考。上状元。但相丑。豹头环眼。铁面虬须。唐德宗见怕。欲撤销其名衔。宰相卢杞拥护。钟馗打卢杞。德宗命拿钟馗。钟馗夺剑他杀。陆贽入谏。封爲驱魔大神。钟馗以爲鬼魔必在九泉。遂去斩之。阎君曰：大伟人鬼之分只在方寸间，心正之鬼可爲神，心歪之人即爲鬼。姓钟大悟。阳间鬼魅有十殿阎君经理。遂返阴间斩妖除了魔。成为了捉鬼大王。",
    "运势": "中吉"
  },
  {
    "签号": 27,
    "福祸宫位": "中签午宫",
    "诗意": "此卦屋好墙壁之象，凡事妥帖无险也。",
    "解曰": "改旧成新冷花遇春畴前障碍今上自上",
    "仙机": "家宅安自身吉求财有交易难婚姻阻六甲女行人迟田蚕熟六畜利寻人迟公讼宜以及移徙吉掉物无踪疾病延安山坟吉",
    "典故": "开墓得珠。晋王乔爲北宋景帝之子，渡江作人质。被世传位王乔于京口的宅兆曾经呈现一颗珠。京口的宅兆呈现珍珠。意爲他今朝以及将来都吉。",
    "运势": "中吉"
  },
  {
    "签号": 28,
    "福祸宫位": "上签午宫",
    "诗意": "此卦风送滕王阁之象，凡事贵人帮助也。",
    "解曰": "谋望有成、婚姻喜、资财旺、家宅吉。",
    "仙机": "家宅安、求财旺、交易成、婚姻吉、六甲男、行人至、田蚕丰、六畜利、寻人见、公讼有理、移徙吉、疾病遇良方、山坟吉。",
    "典故": "滕王阁序。滕王阁是唐代王勃的作品，滕王阁也成为了文化与诗意的象征，风水良好，常有人才出众之事。",
    "运势": "大吉"
  },
  {
    "签号": 29,
    "福祸宫位": "中签未宫",
    "诗意": "此卦柳暗花明之象，凡事得贵人指点也。",
    "解曰": "凡事先难后易，先凶后吉，耐心等待。",
    "仙机": "家宅安、自身吉、求财遂、交易成、婚姻合、六甲男、行人至、田蚕利、六畜旺、寻人见、公讼有理、移徙吉、疾病安、山坟吉。",
    "典故": "吴道子画龙点睛。吴道子是唐代著名画家，传说他画的龙，点睛之后，龙飞腾而起，比喻凡事到最后能有好的结果。",
    "运势": "吉"
  },
  {
    "签号": 30,
    "福祸宫位": "中签未宫",
    "诗意": "此卦天赐良缘之象，凡事喜庆大吉也。",
    "解曰": "婚姻成、谋望遂、诸事如意。",
    "仙机": "家宅安、自身吉、求财有、交易利、婚姻成、六甲男、行人至、田蚕丰、六畜旺、寻人见、公讼有理、移徙吉、疾病安、山坟吉。",
    "典故": "王昭君出塞。王昭君因姿色出众，被选入宫中，但未被汉元帝宠幸，后被赐嫁匈奴，促成汉匈和亲，成佳缘之典。",
    "运势": "大吉"
  },
  {
    "签号": 31,
    "福祸宫位": "中签未宫",
    "诗意": "此卦守旧平安之象，凡事时待时则吉也。",
    "解曰": "守旧平安，叩问神仙，直待时来，事亦偶尔。",
    "仙机": "家宅祈保、自身安、求财守待、交易宜迟、婚姻合、六甲女、行人至、田蚕秋熟、六畜稳、寻人难、公讼以及、移徙吉、掉物虚、疾病殁送、山坟吉。",
    "典故": "佛印会东坡。佛印与苏东坡相遇，互相交流，表现了不慌不忙的智慧和处事方法。",
    "运势": "中吉"
  },
  {
    "签号": 32,
    "福祸宫位": "中签未宫",
    "诗意": "此卦剖石见玉之象，凡事着力乐成也。",
    "解曰": "宝在石中，异人少知，直待明白，较着绝可施为。",
    "仙机": "家宅清淡、自身安、求财劳力、交易阻、婚姻成、六甲虚、行人杳、田蚕晚成、六畜旺、寻人见、公讼惊、移徙改、掉物东方、疾病欠安、山坟改向吉。",
    "典故": "刘备求贤。刘备三顾茅庐，礼请诸葛亮为军师，体现了耐心和坚持的重要性。",
    "运势": "中吉"
  },
  {
    "签号": 33,
    "福祸宫位": "中签未宫",
    "诗意": "此卦藏玉外觅之象，凡事待时可也。",
    "解曰": "内藏金玉，何必外寻，遇贵指引，不须劳心。",
    "仙机": "家宅祈保、自身安、求财守待、交易迟、婚姻就、六甲男、行人阻、田蚕半熟、六畜旺、寻人劳、公讼搁、移徙吉、掉物南方、疾病遇良医、山坟宜改。",
    "典故": "咬金聘仁贵。薛仁贵救了程咬金后被推荐投军，展现了隐藏的才能终会被发现。",
    "运势": "中吉"
  },
  {
    "签号": 34,
    "福祸宫位": "中签未宫",
    "诗意": "此卦红日当空正照之象，凡事遂意也。",
    "解曰": "心中无事，秋水廓清，不须嫌疑，事自然成。",
    "仙机": "家宅清吉、自身安、求财虚、交易难、婚姻合、六甲有险、行人阻、田蚕倒霉、六畜衰、寻人滞、公讼亏、移徙守旧、掉物虚、疾病殁送、山坟大吉。",
    "典故": "桃园结义。刘备、关羽、张飞三人在桃园结拜为兄弟，共同匡扶汉室，表现了团结与忠诚的重要性。",
    "运势": "中吉"
  },
  {
    "签号": 35,
    "福祸宫位": "中签申宫",
    "诗意": "此卦衣冠重整之象，凡事先难后易也。",
    "解曰": "没必要忧疑，自有佳期，若问前程，前路可宜。",
    "仙机": "家宅乱、自身吉、求财好、交易利、婚姻阻、六甲惊、行人至、田蚕倒霉、六畜兴、寻人至、公讼有理、移徙安、掉物迟见、疾病祈福、山坟宜旧。",
    "典故": "唐僧取经。唐玄奘西行取经，历尽艰辛，最终成功带回佛经，体现了坚持和信念的力量。",
    "运势": "中吉"
  },
  {
    "签号": 36,
    "福祸宫位": "中签申宫",
    "诗意": "此卦猿猴脱锁之象，凡事先难后易也。",
    "解曰": "脱除事一时，宽心待上时来，堪寻邪路。",
    "仙机": "家宅不安、自身安、求财大利、交易待时、婚姻未成、六甲祈保、行人至、田蚕实足、六畜平、寻人至、公讼有理、移徙吉、掉物遥、疾病欠安、山坟吉。",
    "典故": "湘子遇宾。韩湘子与吕洞宾是八仙之一，韩湘子被吕洞宾引渡同进山修道登仙，象征解除束缚，寻得自由。",
    "运势": "中吉"
  },
  {
    "签号": 37,
    "福祸宫位": "中签申宫",
    "诗意": "此卦风摇灯烛之象，凡事守常则吉也。",
    "解曰": "静处藏身，待命定时，动惹非福，守旧无疑。",
    "仙机": "家宅守旧、自身清淡、求财有、交易难、婚姻辨别、六甲祈保、行人有信、田蚕秋熟、六畜安、寻人见、公讼以及、移徙守旧、掉物、疾病禳星、山坟勿改。",
    "典故": "李靖回山。托塔天王李靖与其子哪吒协助姜子牙伐纣兴周后，不恋人间功名，辞赏回山修道，象征静守本心，避世修道。",
    "运势": "中吉"
  },
  {
    "签号": 38,
    "福祸宫位": "下签申宫",
    "诗意": "此卦云雾遮月之象，凡事上逞守旧也。",
    "解曰": "家境忧凶，人丁有灾，祈福保庆，犹恐破财。",
    "仙机": "家宅不安、自身祈保、求财难、交易待时、婚姻难合、六甲虚惊、行人阻、田蚕损、六畜损、寻人遇、公讼以及、移徙安、掉物虚、疾病延安、山坟宜修。",
    "典故": "何文秀罹难。穷诗人何文秀因与王琼珍相爱而遭难，经历种种苦难最终团聚，象征困境中耐心等待，终会云开见月。",
    "运势": "下吉"
  },
  {
    "签号": 39,
    "福祸宫位": "下签酉宫",
    "诗意": "此卦守常沉寂之象，凡事守己则吉也。",
    "解曰": "各样用计，白费工夫，不如守旧，着甚起因。",
    "仙机": "家宅安、自身提防、求财清淡、交易阻、婚姻辨别、六甲女、行人动、田蚕利、六畜损、寻人难、公讼亏、移徙平、掉物空、疾病殁送安、山坟大吉。",
    "典故": "姜女寻夫。孟姜女为寻夫范杞郎历尽艰辛，最终长城崩塌，象征忠贞不渝，守护本心。",
    "运势": "下吉"
  },
  {
    "签号": 40,
    "福祸宫位": "中签酉宫",
    "诗意": "此卦阴长阳消之象，凡事先难后易也。",
    "解曰": "阴利密斯，不宜女子，若是求谋，先凶后吉。",
    "仙机": "家宅倒楣、自身祈福、求财守待、交易吉、婚姻辨别、六甲虚、行人阻、田蚕旺、六畜旺、寻人隔、公讼亏、移徙大吉、掉物空、疾病有惊、山坟大吉。",
    "典故": "武则天即位。武则天由唐太宗之妃，最终成为皇帝，象征女性在逆境中崛起，终成大业。",
    "运势": "中吉"
  },
  {
    "签号": 41,
    "福祸宫位": "中签酉宫",
    "诗意": "此卦认贼作子之象，凡事细致防假。",
    "解曰": "只这一着，小人莫错，牢记在心，不生孑立。",
    "仙机": "家宅不安、自身去常、求财守待、交易难、婚姻未合、六甲男惊、行人至、田蚕半熟、六畜安、寻人至、公讼宜以及、移徙祈保、掉物、疾病禳星、山坟中平。",
    "典故": "董卓收吕布。三国演义中，董卓用良马和金钱收买吕布，并认吕布为义子。后吕布私通董卓爱妾貂蝉，二人交恶，吕布与王允合谋杀董卓，最终吕布被曹操擒杀，象征因利诱导致背叛的危险。",
    "运势": "中吉"
  },
  {
    "签号": 42,
    "福祸宫位": "上签酉宫",
    "诗意": "此卦天垂膏泽恩泽之象，凡事效果大吉也。",
    "解曰": "天皇降恩，一向莫忘，晨昏礼佛，可宜烧喷鼻。",
    "仙机": "家宅祈福、自身冬吉、求财未有、交易成、婚姻中吉、六甲平安、行人动、田蚕中平、六畜中平、寻人见、公讼胜、移徙守旧、掉物空、疾病解、山坟安。",
    "典故": "目莲救母。目莲是佛门的尊者，有法术，母亲因作恶多端在地狱受苦，目莲设法救度其母，依佛祖指示设盂兰盆会，最终解救母亲，并普渡众人父母，象征孝道和善行。",
    "运势": "上吉"
  },
  {
    "签号": 43,
    "福祸宫位": "上签戌宫",
    "诗意": "此卦大地交泰之象，凡事大吉无危也。",
    "解曰": "天生万物，谋看皆通，福德相助，瑞气仓卒。",
    "仙机": "家宅吉、自身安、求财有、交易利、婚姻合、六甲男、行人有阻、田蚕中平、六畜中平、寻人见、公讼胜、移徙利、掉物对象、疾病禳星、山坟对象吉。",
    "典故": "行者上道。西游记中，孙悟空拜师须菩提祖师，学得长生之道和七十二变，象征追求智慧和力量，最终达成目标。",
    "运势": "上吉"
  },
  {
    "签号": 44,
    "福祸宫位": "中签戌宫",
    "诗意": "此卦棋逢敌手之象，凡事用布局则吉也。",
    "解曰": "欲求心事，恰如围棋，终于成功，宜用心计。",
    "仙机": "家宅大利、自身颠簸、求财遂、交易利、婚姻未合、六甲女、行人阻、田蚕平、六畜损、寻人阻、公讼宜以及、移徙守旧、掉物空、疾病祈保、山坟守旧。",
    "典故": "姜维邓艾斗阵。三国时，姜维（蜀）与邓艾（魏）会师祈山，摆八卦阵和长蛇阵，象征战略智慧和心计。",
    "运势": "中吉"
  },
  {
    "签号": 45,
    "福祸宫位": "上签戌宫",
    "诗意": "此卦积德温和之象，凡事贵人和合也。",
    "解曰": "天地有感，应验特别，佛神护佑，上之莫忘。",
    "仙机": "家宅吉、自身安、求财遂、交易利、婚姻合、六甲男、行人阻、田蚕秋利、六畜中平、寻人见、公讼胜、移徙利、掉物西方、疾病祈福、山坟对象向吉。",
    "典故": "仁宗认母。宋仁宗皇帝通过包公审案，揭开狸猫换太子真相，最终迎回亲生母亲，象征善有善报和孝道。",
    "运势": "上吉"
  },
  {
    "签号": 46,
    "福祸宫位": "中签戌宫",
    "诗意": "此卦枯木生花之象，凡事自有效果也。",
    "解曰": "守旧守旧事自效果，动则多殃，静则无咎。",
    "仙机": "家宅安、自身吉、求财待时、交易成、婚姻就、六甲生女、行人阻、田蚕五分、六畜难、寻人杳、公讼吉、移徙守旧、掉物空、疾病求福、山坟吉。",
    "典故": "渭水钓鱼。周代姜尚（字子牙），避纣乱居渭水，以直钩钓鱼，意在等待明君。文王闻其贤，聘为丞相。此典故象征静待机缘。",
    "运势": "中吉"
  },
  {
    "签号": 47,
    "福祸宫位": "上签亥宫",
    "诗意": "此卦如虎添翼之象，凡事大吉大利也。",
    "解曰": "守旧变新，运至功成，遂一生志，皆是命。",
    "仙机": "家宅祈保、自身安、求财利、交易阻、婚姻合、六甲生男、行人迟、田蚕八分、六畜平、寻人至、公讼宜以及、移徙吉、掉物东南、疾病作福、山坟利。",
    "典故": "梁灏中举。宋朝诗人梁灏，字太素，18岁考上秀才，至80岁才中状元，象征功名迟来但终成大器。",
    "运势": "上吉"
  },
  {
    "签号": 48,
    "福祸宫位": "中签亥宫",
    "诗意": "此卦昆鹏兴变之象，凡事有变革大吉。",
    "解曰": "昆鸟化鹏，万禽不能，桂喷鼻一折，福禄自增。",
    "仙机": "家宅利、自身吉、求财秋旺、交易迟、婚姻辨别、六甲安、行人障碍、田蚕中平、六畜春利、寻人见、公讼胜、移徙守旧、掉物西、山坟安、疾病祈保。",
    "典故": "韩信挂帅。韩信，淮阴人，辅佐汉高帝刘邦，平定天下。象征才智出众，等待良机。",
    "运势": "中吉"
  },
  {
    "签号": 49,
    "福祸宫位": "中签亥宫",
    "诗意": "此卦水结成冰之象，凡事没必要枉求也。",
    "解曰": "水结成冰，冰消成水，若是营谋，终于如是。",
    "仙机": "家宅不安、自身祈保、求财难、交易阻、婚姻辨别、六甲险、行人迟、田蚕亏、六畜损、寻人见、公讼宜和、移徙守旧、掉物空、疾病难痊、山坟大吉。",
    "典故": "王祥求鲤。晋朝王祥，字伏征，以孝道闻名。继母欲食生鱼，祥赤身卧冰求之，冰裂得鲤鱼，象征孝感动天。",
    "运势": "中吉"
  },
  {
    "签号": 50,
    "福祸宫位": "中签亥宫",
    "诗意": "此卦顺风撑舟之象，凡事皆顺大吉也。",
    "解曰": "自由休悠，不须着力，财禄重重，无不欣美。",
    "仙机": "家宅利、自身吉、求财利西、交易宜迟、婚姻辨别、六甲安、行人阻、田蚕秋利、六畜春旺、寻人至、公讼亏、移徙守旧、掉物东方、疾病解、山坟南利。",
    "典故": "陶朱回五湖。范蠡（字少伯），吴人，辅佐越王勾践灭吴，功成后辞官隐居五湖，以商致富，象征归隐自得。",
    "运势": "中吉"
  },
  {
    "签号": 51,
    "福祸宫位": "上签子宫",
    "诗意": "此卦大家愁暖之象，凡事随心从意也。",
    "解曰": "入退莫疑，自有佳期，营谋用度，不须妄为。",
    "仙机": "家宅祈福、自身谨防(凶中有吉)、求财秋吉、交易去常、婚姻合、六甲生男、行人动、田蚕损、六畜平、寻人见、公讼吉、移徙旧、掉物南方、疾病还愿、山坟吉。",
    "典故": "孔明进川。刘备缺地皮，刘璋邀请其进益州同抗张鲁。孔明随刘备进益州，详察地形，安插布置，西川成为刘备发祥地。",
    "运势": "上吉"
  },
  {
    "签号": 52,
    "福祸宫位": "中签子宫",
    "诗意": "此卦贪求费劲之象，凡事劳心费劲也。",
    "解曰": "言语难思，费劲劳心，宅中忧恼，酬报贵人。",
    "仙机": "家宅不安、自身欠吉、求财中平、交易难、婚姻未就、六甲祈保、行人有灾、田蚕五分、六畜衰、寻人凶、公讼以及、移徙去常、掉物空、山坟吉、疾病祈保。",
    "典故": "太白醉捞明月。唐朝诗人李白，醉酒到湖边，见月在水中，欲抱之，溺水而亡。象征劳而无功。",
    "运势": "中吉"
  },
  {
    "签号": 53,
    "福祸宫位": "中签子宫",
    "诗意": "此卦龙吟虎啸之象，凡事顺意无看也。",
    "解曰": "教往即往，教住即住，自有益市，到头必利。",
    "仙机": "家宅不安、自身欠吉、求财中平、交易难、婚姻效果、六甲祈保、行人至、田蚕五分、六畜损、寻人至、公讼以及、移徙吉、掉物见、疾病安、山坟吉。",
    "典故": "刘备招亲。刘备为荆州牧时，东吴孙权以妹招赘，孔明授计，刘备娶孙夫人，回荆州，象征顺利成功。",
    "运势": "中吉"
  },
  {
    "签号": 54,
    "福祸宫位": "下签子宫",
    "诗意": "此卦梦中上宝之象，凡事白费心力也。",
    "解曰": "物在水中，形影是非，皆有分定，没必要筹议。",
    "仙机": "家宅欠安、自身谨防、求财阻、交易难、婚姻待时、六甲祈保、行人迟、田蚕滞、六畜滞、寻人见、公讼亏、移徙吉、掉物空、疾病求神保佑、山坟不安。",
    "典故": "马超追曹。三国时曹操杀马超之父，马超攻曹操，曹操大败，逃脱得救。象征无果的追求。",
    "运势": "下吉"
  },
  {
    "签号": 55,
    "福祸宫位": "中签丑宫",
    "诗意": "此卦接竹引泉之象，凡事谋看大吉也。",
    "解曰": "接竹引泉，流传不断，小人谋看，无不欣悦。",
    "仙机": "家宅欠安、自身还愿、求财利、交易成、婚姻合、六甲以及平、行人动、田蚕吉、六畜损、寻人难、公讼有贵人、移徙吉、掉物见、疾病禳星、山坟安。",
    "典故": "周武王伐纣。八百诸侯战商军，纣王自焚，商朝灭亡，武王即位，开创盛世。象征大业成就。",
    "运势": "中吉"
  },
  {
    "签号": 56,
    "福祸宫位": "中签丑宫",
    "诗意": "此卦舟行小滩之象，凡事有贵人助也。",
    "解曰": "营谋用事，劳心费劲，守旧待时，凡事大吉。",
    "仙机": "家宅安、自身吉、求财中平、交易利、婚姻遂意、六甲男、行人至、田蚕秋利、六畜损、寻人至、公讼有理、移徙吉、掉物滞、疾病即安、山坟宜修。",
    "典故": "禄山谋反。营州胡人安禄山，唐玄宗时为节度使，谋反占领洛阳、长安，后被其子所杀。",
    "运势": "中吉"
  },
  {
    "签号": 57,
    "福祸宫位": "中签丑宫",
    "诗意": "此卦孩儿见母之象，诸事贵人大吉也。",
    "解曰": "所用谋看，民怨沸腾，从公使劲，如子逢娘。",
    "仙机": "家宅不安、自身清淡、求财顺、交易成、婚姻合、六甲女、行人阻、田蚕就、六畜损、寻人难、公讼宜、移徙守旧、掉物空、疾病祈福、山坟吉。",
    "典故": "董仲寻亲。汉朝董永之子董仲，寻母至太白山，七月七日见母仙女。",
    "运势": "中吉"
  },
  {
    "签号": 58,
    "福祸宫位": "中签丑宫",
    "诗意": "此卦守旧待时之象，凡事守旧则吉也。",
    "解曰": "上住且住，可取且踞，莫宜别事，只宜守旧。",
    "仙机": "家宅去常、自身倒楣、求财吉、交易成、婚姻阻、六甲惊、行人迟、田蚕五分、六畜损、寻人见、公讼亏、移徙守旧、掉物凶、疾病欠安、山坟宜改。",
    "典故": "文王问卜。周文王善卜，被纣王召见，卜之不吉，命长子留守。文王被软禁，后其子违命被杀。文王守旧修《易经》。",
    "运势": "中吉"
  },
  {
    "签号": 59,
    "福祸宫位": "中签寅宫",
    "诗意": "此卦守旧随时之象，凡事待时则吉。",
    "解曰": "如醉饮酒，只宜守旧，直待时来，无灾无咎。",
    "仙机": "家宅祈福、自身安、求财去常、交易成、婚姻辨别、六甲作福、行人至、田蚕半吉、六畜大利、寻人阻、公讼亏、移徙吉、掉物凶、疾病祈福、山坟吉。",
    "典故": "张良隐山。汉朝张良助刘邦取天下后，知其为人，为保命隐退不知所踪。",
    "运势": "中吉"
  },
  {
    "签号": 60,
    "福祸宫位": "下签寅宫",
    "诗意": "此卦抱薪救火之象，凡事亦自谨防也。",
    "解曰": "有各种计，不如莫动，一旦相惹，恐祸回身。",
    "仙机": "家宅凶、自身祈保、求财轻轻、交易辨别、婚姻辨别、六甲险、行人滞、田蚕倒楣、六畜损、寻人杳、公讼亏、移徙吉、掉物东方、疾病有惊、山坟清淡。",
    "典故": "赤壁鏖兵。三国时，曹操大军入驻赤壁，孙权将周瑜联合刘备抗曹，火烧连环舟，曹军大败。史称赤壁之战。",
    "运势": "下吉"
  },
  {
    "签号": 61,
    "福祸宫位": "中签寅宫",
    "诗意": "此卦守旧随时之象，凡事时吉利也。",
    "解曰": "才子在屋吟唱诗曲一片欢心，射中祸福。",
    "仙机": "家宅安、自身吉、求财顺、交易利、婚姻成、六甲女、行人至、田蚕熟、六畜旺、寻人至、移徙吉、掉物凶、公讼有理、疾病即康复、山坟大吉。",
    "典故": "苏小妹难夫。宋朝苏东坡之妹苏小妹，新婚夜考夫婿，三个难题刁难秦少游，最终苏东坡暗助解决。",
    "运势": "中吉"
  },
  {
    "签号": 62,
    "福祸宫位": "中签寅宫",
    "诗意": "此卦神佛暗佑之象，凡事忍受大吉也。",
    "解曰": "平颠簸稳，四方名显，改旧从新亦无凶狠。",
    "仙机": "家宅安、自身吉、求财东方、交易遂、婚姻成、六甲祈福、行人阻、田蚕七分、六畜利、寻人东方、公讼亏、移徙守旧、掉物见、疾病祈福、山坟吉。",
    "典故": "唐僧上道。唐僧师徒离开大河畔，佛祖化身舟夫救唐僧，唐僧悔改，超常进圣登佛道。",
    "运势": "中吉"
  },
  {
    "签号": 63,
    "福祸宫位": "中签卯宫",
    "诗意": "此卦海中寻针之象，凡事费心劳力也。",
    "解曰": "福是禄基，禄是福，种说上明白较着，切宜守谨。",
    "仙机": "家宅欠利、自身谨防、求财有、交易成、婚姻辨别、六甲阻、行人滞、田蚕吉、六畜莫养、寻人难、公讼宜、移徙宜迁、掉物凶、疾病难痊、山坟暂安。",
    "典故": "女娲氏炼石。女娲炼五彩石修补天空，修补天地。",
    "运势": "中吉"
  },
  {
    "签号": 64,
    "福祸宫位": "下签卯宫",
    "诗意": "此卦鱼遭罗网之象，凡事亦宜提防也。",
    "解曰": "屋下藏身，祸从天降，早觉先防，免遇难殃。",
    "仙机": "家宅凶、自身险、求财虚、交易中平、婚姻辨别、六甲惊、行人有阻、田蚕损、六畜衰、寻人杳、公讼亏、移徙吉、掉物凶、疾病有灾险、山坟宜改。",
    "典故": "汉朝会稽郡买臣，妻子嫌贫离婚，后悔要求复合，买臣泼水示断，不再复合。",
    "运势": "下吉"
  },
  {
    "签号": 65,
    "福祸宫位": "下签卯宫",
    "诗意": "此卦割肉成疮之象，凡事只宜守旧待时。",
    "解曰": "知止则止，知宽自宽，割自身肉疾痛平常。",
    "仙机": "家宅不安、自身口舌、求财倒楣、交易君子、婚姻不长、六甲有惊、行人阻、田蚕损、六畜损、寻人招非、公讼亏、移徙守旧、掉物难寻、疾病几次、山坟。",
    "典故": "孙膑困庞涓。战国时孙膑遭庞涓刖足，假作颠狂，后用计胜庞涓。",
    "运势": "下吉"
  },
  {
    "签号": 66,
    "福祸宫位": "下签卯宫",
    "诗意": "此卦舟破下滩之象，凡事险阻提防也。",
    "解曰": "守旧待时沉寂无咎，没必要求谋，自由悠游。",
    "仙机": "家居丧疑、自身灾耗、求财破、掉交易败、婚姻不长、六甲迫害、行人阻、田蚕损、六畜损、寻人杳、公讼亏、移徙莫动、山坟倒楣、疾病即殁送。",
    "典故": "霸王被困。楚霸王项羽自以为无敌，被韩信困于垓下，最后自刎乌江。",
    "运势": "下吉"
  },
  {
    "签号": 67,
    "福祸宫位": "上签卯宫",
    "诗意": "此卦心公正大之象，凡事巩固无凶也。",
    "解曰": "心公正大，终于功能清平，只依本份，世界镇静。",
    "仙机": "家宅安、自身平、求财守慎、交易稳、婚姻合、六甲男、行人有信、田蚕稳、六畜安、寻人迟、公讼以及、移徙守旧、掉物见、山坟平、疾病禳星。",
    "典故": "金精试窦儿。窦燕山因行善积德，子孙显贵，窦仪拒绝试探者，最终得到金精。",
    "运势": "上吉"
  },
  {
    "签号": 68,
    "福祸宫位": "中签卯宫",
    "诗意": "此卦门廷吉庆之象，凡事顺遂也。",
    "解曰": "积德之家必不够庆，忠义之门拱照福星。",
    "仙机": "家宅旺、自身安、求财春旺、交易遂、婚姻成、六甲防惊、行人到、田蚕利、六畜旺、寻人至、公讼胜、移徙如意、掉物急寻、疾病安、山坟大吉。",
    "典故": "汾阳王郭子仪祝寿。郭子仪身经百战，家中显贵，寿考富贵，亲友纷至。",
    "运势": "中吉"
  },
  {
    "签号": 69,
    "福祸宫位": "中签辰宫",
    "诗意": "此卦梅花占魁之象，凡事务迟则吉也。",
    "解曰": "一箭射空，待春来彩在个中。",
    "仙机": "家宅欠利、自身作福、求财郑重、交易待时、婚姻迟成、六甲春实秋虚、行人迟至、田蚕旺、六畜旺、寻人见、公讼亏、掉物西方、疾病虚惊、山坟宜改。",
    "典故": "梅开二度。梅魁被害，梅良玉改名，最终科举成功，梅花再开。",
    "运势": "中吉"
  },
  {
    "签号": 70,
    "福祸宫位": "下签辰宫",
    "诗意": "此卦蜜蜂采花之象，凡事劳心费劲也。",
    "解曰": "无觅春色，久雨不晴，求谋用事不如沉寂。",
    "仙机": "家宅口舌、自身君子、求财破费、交易几次、婚姻不长、六甲虚花、行人杳、田蚕损、六畜损、寻人无踪、公讼亏、移徙守旧、掉物空、疾病有阻、山坟改。",
    "典故": "李密反唐。隋末李密反叛，最终被乱箭射死。",
    "运势": "下吉"
  },
  {
    "签号": 71,
    "福祸宫位": "中签辰宫",
    "诗意": "此卦一弓架两箭之象，凡事再合则吉也。",
    "解曰": "不出重重事由定数，振放中开，切宜谨守。",
    "仙机": "家宅丧掉、自身黑白、求财劳力、交易谨防、婚姻再合、六甲先虚后实、行人阻、田蚕晚收、六畜损、寻人见、公讼亏、移徙吉、疾病禳星、山坟改。",
    "典故": "文君访相如。文君因爱诗文，私奔至成都，与司马相如结为夫妻。",
    "运势": "中吉"
  },
  {
    "签号": 72,
    "福祸宫位": "中签辰宫",
    "诗意": "此卦结蜂采蜜之象，诸事劳心费劲；此卦求甜上苦之象，凡事防御灾殃。",
    "解曰": "事须详实，没必要强求，结蜂采蜜有甚起因。",
    "仙机": "家宅欠利、自身防、求财阻、交易迟、婚姻隔尽、六甲虚惊、行人迟、田蚕少收、六畜少收、寻人难、公讼亏、移徙莫动、掉物凶、疾病殁送、山坟败。",
    "典故": "王莽求贤。王莽广结贤良，最后因篡汉被刘秀推翻。",
    "运势": "中吉"
  },
  {
    "签号": 73,
    "福祸宫位": "上签宫",
    "诗意": "此卦雷发百虫之象，凡事遇贵人凶兆也。",
    "解曰": "雷发时转入出两存，一朝变革直到天门。",
    "仙机": "家宅祈福、自身去常、求财春利、交易贵人、婚姻成、六甲男、行人到、田蚕早生、六畜春利、寻人见、公讼胜、移徙吉、掉物疾病险阻、山坟吉。",
    "典故": "陈桥兵变。赵匡胤在陈桥兵变后登上皇位，建立了宋朝。",
    "运势": "上吉"
  },
  {
    "签号": 74,
    "福祸宫位": "下签宫",
    "诗意": "此卦似鹄投笼之象，凡事多虚少实也。",
    "解曰": "入身不上，退步为难，仰头直往悉在个中。",
    "仙机": "家宅不安、自身困滞、求财君子、交易破费、婚姻刑伤、六甲刑劫、行人阻、田蚕缺、六畜瘟、寻人杳、公讼祸、移徙倒楣、掉物凶、疾病延、山坟尽。",
    "典故": "秦败擒三帅。秦国与晋国交战，最终秦军大败，三个大元帅被俘。",
    "运势": "下凶"
  },
  {
    "签号": 75,
    "福祸宫位": "中签午宫",
    "诗意": "此卦抱虎过山之象，凡事险凶恐怖也。",
    "解曰": "危迫害险，前程有阻，若问求谋终于功能辛苦。",
    "仙机": "家宅祈保、自身提防、求财郑重、交易滞、婚姻难顺、六甲有惊、行人阻、田蚕五分、六畜损、寻人杳、公讼亏、移徙守、掉物难、疾病祭虎、山坟凶。",
    "典故": "伍员夜出昭关。伍子胥在楚国被追杀，夜行至昭关，最终成功逃脱。",
    "运势": "中凶"
  },
  {
    "签号": 76,
    "福祸宫位": "中签午宫",
    "诗意": "此卦鱼龙未变之象，凡事待时至可也。",
    "解曰": "虽是滋基，也要待时营谋，自本切莫妄为。",
    "仙机": "家宅以及平、自身康泰、求财有益、交易遂意、婚姻迟合、六甲生男、行人迟、田蚕晚丰、六畜尾利、寻人未遇、公讼延、移徙守旧、掉物疾病阻、山坟发。",
    "典故": "洪武瞅牛。朱元璋小时贫困，后来成为明朝开国皇帝，经历了许多艰难。",
    "运势": "中吉"
  },
  {
    "签号": 77,
    "福祸宫位": "中签午宫",
    "诗意": "此卦梦中上宝之象，凡事虚几何实也。",
    "解曰": "如梦说梦，阐明莫看，只待好时贵人指挥。",
    "仙机": "家宅祈福、自身阻、求财虚、交易难成、婚姻辨别、六甲虚、行人迟、田蚕不收、六畜损、寻人杳、公讼以及、移徙待时、掉物遥、疾病殁送、山坟改。",
    "典故": "赵国蔺相如带着和氏璧去秦国，巧妙应对，最终将璧带回赵国。",
    "运势": "中吉"
  },
  {
    "签号": 78,
    "福祸宫位": "上签午宫",
    "诗意": "此卦平善用事之象，凡事颠簸大吉也。",
    "解曰": "囚人逢赦，病遇良医，求财谋看贵人指挥。",
    "仙机": "家宅安、自身吉、求财遂意、交易成、婚姻合、六甲男、行人至、田蚕熟、六畜旺、寻人至、公讼散、移徙大吉、掉物即见、疾病平安、山坟大吉利。",
    "典故": "临潼救驾。秦琼夜间突入重围，救了唐王李渊。",
    "运势": "上吉"
  },
  {
    "签号": 79,
    "福祸宫位": "中签午宫",
    "诗意": "此卦信实莫信虚之象，凡事守旧之兆也。",
    "解曰": "人有我见心没必要忙，观音指挥切莫慢待。",
    "仙机": "家宅还愿、自身许经、求财守份、交易郑重、婚姻虚、六甲生女、行人滞、田蚕七分、六畜损、寻人杳、公讼以及、移徙守、掉物东方、疾病解、山坟西向。",
    "典故": "暗扶倒铜旗。秦叔宝攻破东岭关，最终成功。",
    "运势": "中吉"
  },
  {
    "签号": 80,
    "福祸宫位": "上签未宫",
    "诗意": "此卦贵人接引之象，凡事和合大吉也。",
    "解曰": "善始善终，莫向西东，心中用事贵人重重。",
    "仙机": "家宅以及平、自身吉利、求财有益、交易遂意、婚姻双配、六甲男、行人归、田蚕半收、六畜胜、寻人遇、公讼胜、移徙吉、掉物南、疾病安、山坟吉。",
    "典故": "智遥投军。刘智遥投靠岳勋，后来成为后汉的皇帝。",
    "运势": "上吉"
  },
  {
    "签号": 81,
    "福祸宫位": "上签未宫",
    "诗意": "此卦梧桐叶落之象，凡事先凶后吉也。",
    "解曰": "心中取事天必从之，营谋用事绝可施为。",
    "仙机": "家宅祈保、自身许经、求财遂意、交易成、婚姻以及合、六甲虚惊、行人动、田蚕晚胜、六畜稳、寻人至、公讼胜、移徙随意、掉物疾病喜、山坟择地。",
    "典故": "风送滕王阁。王勃在梦中得到指引，最终成功到达滕王阁，并写下《滕王阁序》。",
    "运势": "上吉"
  },
  {
    "签号": 82,
    "福祸宫位": "中签未宫",
    "诗意": "此卦火里生莲之象，凡事似险非险也。",
    "解曰": "虽然逢险不损其身，营谋用事皆遇贵人。",
    "仙机": "家宅欠安、自身谨防、求财劳力、交易君子、婚姻阻、六甲虚惊、行人阻、田蚕缺、六畜损、寻人西、公讼亏、移徙守旧、掉物南、疾病殁送、山坟改。",
    "典故": "火烧葫芦谷。三国时期，曹操在赤壁之战中大败，孔明派将领隐藏，曹操至葫芦谷口时笑谈，却突遭张飞袭击，狼狈逃脱，败走华容道。",
    "运势": "中签"
  },
  {
    "签号": 83,
    "福祸宫位": "中签未宫",
    "诗意": "此卦月缺未圆之象，凡事候时则吉也。",
    "解曰": "守旧待时，如月初出待等圆时，无有不吉。",
    "仙机": "家宅许愿、自身夏秋吉、求财谨守、交易待时、婚姻迟、六甲生女、行人阻、田蚕颠簸、六畜颠簸、寻人难、公讼以及、移徙守旧、掉物难、疾病殁送、山坟改。",
    "典故": "李渊即位。公元618年，隋炀帝在江都被杀，唐王李渊在太原登基称帝，建立唐朝。李渊在位九年，由李世民接位，逐渐走向佳景。",
    "运势": "中签"
  },
  {
    "签号": 84,
    "福祸宫位": "下签未宫",
    "诗意": "此卦冷鱼离水招凶之象，凡事不成移动也。",
    "解曰": "冷鱼离水，天衣无缝。若问营谋，不如莫起。",
    "仙机": "此签六甲煞旺，诸事倒楣。禳灾保安。",
    "典故": "庄子试妻。周朝时期，庄子试探妻子的忠贞，妻子田氏在丈夫不在时，假作守孝的楚国王孙公子来访，最后庄子破棺而出，妻子羞愧而死。",
    "运势": "下签"
  },
  {
    "签号": 85,
    "福祸宫位": "中签申宫",
    "诗意": "此卦春绝花开之象，凡同族儿后窜改也。",
    "解曰": "老者用求春残再开，欲求名利晚遇横财。",
    "仙机": "家宅欠利、自身郑重、求财着力、交易平、婚姻迟、六甲女、行人阻、田蚕好、六畜好、寻人难、公讼几次、移徙更新、掉物凶、疾病延滞、山坟宜改。",
    "典故": "韩文公遇雪。韩愈被贬至潮州，在蓝关遇大雪，马无法前行，韩愈叹息皇天欲绝，之后悟出意思，放弃官职，修道成仙。",
    "运势": "中签"
  },
  {
    "签号": 86,
    "福祸宫位": "上签申宫",
    "诗意": "此卦上朝见帝之象，凡事太吉大利也。",
    "解曰": "朝帝受职如贫上宝，谋看从心卦中第一。",
    "仙机": "此签从心所欲，诸事皆吉。",
    "典故": "商辂中三元。明朝商辂，浙江人，父早亡，商辂中三元，象征步步高升（乡试解元、省试会元、殿试状元）。",
    "运势": "上签"
  },
  {
    "签号": 87,
    "福祸宫位": "中签申宫",
    "诗意": "此卦淘沙见金人处险境之象，凡事有贵人之兆也。",
    "解曰": "凿石见玉，淘沙见金，必要着力只是劳心。",
    "仙机": "家宅祈福、自身欠利、求财劳心、交易郑重、婚姻有阻、六甲虚、行人迟、田蚕颠簸、六畜颠簸、寻人未遇、公讼亏、移徙守、掉物凶、疾病阻、山坟不阻。",
    "典故": "咬金探地穴。程咬金为庆功，在演武杨摆宴时，突然裂开一个深洞，他进入洞中见到石造的门桌椅等，最后穿越洞口成为三年混世魔王。",
    "运势": "中签"
  },
  {
    "签号": 88,
    "福祸宫位": "中签酉宫",
    "诗意": "此卦木虎有威之象，凡事虚惊少实也。",
    "解曰": "炉头点雪似耳边风，可宜作福后吉前凶。",
    "仙机": "家宅不安、自身口舌、求财君子、交易倒楣、婚姻辨别、六甲虚险、行人阻、田蚕损、六畜损、寻人杳、公讼亏、移徙守旧、掉物凶、疾病祭虎、山坟凶。",
    "典故": "庞洪畏包公。宋朝仁宗时期，包公审理庞洪案件，庞洪惊畏不已，最终案件证明庞洪诬害，皇帝赦免庞洪。",
    "运势": "中签"
  },
  {
    "签号": 89,
    "福祸宫位": "上签酉宫",
    "诗意": "此卦石躲宝物之象，凡事自上大吉也。",
    "解曰": "如石躲玉，贵人指挥，上祗自上欢怀自尊。",
    "仙机": "家宅吉利、自身康泰、求财遂意、交易成、婚姻效果、六甲生男、行人动、田蚕着力、六畜勤理、寻人见、公讼胜、移徙吉、掉物在、疾病安、山坟吉。",
    "典故": "智服姜维。姜维被诸葛亮巧妙智取，最终归顺刘备，诸葛亮对其极为尊敬，姜维也甘心效忠。",
    "运势": "上签"
  },
  {
    "签号": 90,
    "福祸宫位": "上签酉宫",
    "诗意": "此卦功名效果之象，凡事务入大吉也。",
    "解曰": "若问功名前有贵人，更添怒火财禄丰盈。",
    "仙机": "此签诸事佳吉，求之顺遂。",
    "典故": "韦佩遇仙。诗人韦佩用驴换鳖放生，后遇贵人，官运亨通，最终加官晋爵。",
    "运势": "上签"
  },
  {
    "签号": 91,
    "福祸宫位": "中签申宫",
    "诗意": "尔乘病马渡危坡，难免疏虞腐朽多；幸赖执鞭人上力，不教险处有蹉跎。",
    "解曰": "李旦受苛虐后装疯逃避，最终得到救助。此签者命运暂时窘迫，但有第三者帮助，能化险为夷。",
    "仙机": "凡事需谨慎，虽有暂时困境，但有助力可解。",
    "典故": "李旦装疯逃避困境，最终得救助重返朝廷。",
    "运势": "中签"
  },
  {
    "签号": 92,
    "福祸宫位": "上签辰宫",
    "诗意": "雷声大，雨点小，纵好不好；事在解铃人，福自矫正，多行善可保。",
    "解曰": "刘备在危难时离开许都，因宽厚待人得到众人支持。此签者应谨慎行事，虽然初期有困境，但最终会有好结果。",
    "仙机": "虽有初期困境，但因善行可转危为安。",
    "典故": "刘备被曹操逼迫时，因善待民众得以安全脱困。",
    "运势": "上签"
  },
  {
    "签号": 93,
    "福祸宫位": "中签未宫",
    "诗意": "心急马行迟，妄干何无益；一时安份，天神护吉。",
    "解曰": "梁山伯因未及时知道祝英台的真实身份而错失机会。此签者应保持稳定，虽有困境，天神护佑，最终会化险为夷。",
    "仙机": "应稳定情绪，顺其自然，最终会有好的结果。",
    "典故": "梁山伯错失良机，但天神护佑，最终有所转机。",
    "运势": "中签"
  },
  {
    "签号": 94,
    "福祸宫位": "上签巳宫",
    "诗意": "事已经云云，悔之何及；纵有吉祥，还宜阴骘。",
    "解曰": "蒙正因贫困而寄住庙宇，最终通过艰难努力获得成功。此签者应按既定计划进行，不必后悔，积德行善会带来福气。",
    "仙机": "按理行事，不必过于后悔，积德行善将有福。",
    "典故": "蒙正因贫困而努力读书，最终中状元。",
    "运势": "上签"
  },
  {
    "签号": 95,
    "福祸宫位": "中签午宫",
    "诗意": "已经进笼，何可脱；已经掉落，难觅着。遇鸡鼠，自知觉；病果起，勿服药。",
    "解曰": "孟尝君被诬告避难时，虽经历困境，但善行积累最终获得转机。此签者应小心应对当前困境，积德行善将有转机。",
    "仙机": "在困境中应保持谨慎，积德行善将助于化解危机。",
    "典故": "孟尝君在困境中得到救助，最终重掌权位。",
    "运势": "中签"
  },
  {
    "签号": 96,
    "福祸宫位": "下签",
    "诗意": "潭深鱼不饵，鸟飞难弋获；事态已经云云，一笑又一哭。",
    "解曰": "人生的上与掉是格外极度奇奥的，所谓有一上必有一掉。即使遇到困难和挫折，也要保持乐观和努力，积善行善可解困。",
    "仙机": "凡事需郑重，积德行善以解忧。",
    "典故": "孟姜女寻夫的故事，因丈夫去世，悲痛至长城崩塌。",
    "运势": "诸事倒楣，宜郑重提防"
  },
  {
    "签号": 97,
    "福祸宫位": "中签",
    "诗意": "休咎相半人宜识，莫任劳劳损有利；有时偶尔天运一送还，自然天道无痕迹。",
    "解曰": "心中已有计划，不必急于求成。只需耐心等待时机，终会有所成就，若急于求成则可能带来不利。",
    "仙机": "耐心等待，勿急于求成。",
    "典故": "范仲淹自卖字谋生，最终因坚持和努力获得成功。",
    "运势": "初期运虽蹇，后必上利市"
  },
  {
    "签号": 98,
    "福祸宫位": "中签",
    "诗意": "东不如西，也要识时，是乃有命；可不知之，知时命，久谋自合宜。",
    "解曰": "成功的难易无定时，时运的好坏决定了结果。只要顺应时机，努力而不怠惰，一切皆有可能。",
    "仙机": "顺应时机，努力不懈。",
    "典故": "姜太公垂钓等待机缘，最终成为周国的大臣。",
    "运势": "营谋事虽成，但必费颇多心力始能达至"
  },
  {
    "签号": 99,
    "福祸宫位": "下签",
    "诗意": "虎在路途边，行人莫乱呼；路旁须详实，磨难自然无。",
    "解曰": "遇到困难时需谨慎，避免惊扰可能带来的风险。保持冷静和细心处理问题，将有望化解困境。",
    "仙机": "遇事保持冷静，细心应对。",
    "典故": "邓艾与钟会分军灭蜀，经历了磨难和挫折，但最终仍有可为之事。",
    "运势": "凡事不要耐烦，纵有灾晦祸害，也可无碍"
  },
  {
    "签号": 100,
    "福祸宫位": "中签",
    "诗意": "桃李谢春风，西飞又复东；家顶专心绪，舟在波涛中。",
    "解曰": "外部的变化和冲击较大，需谨慎应对。虽然内部稳定，但外来的变故需小心处理。",
    "仙机": "提防外来变故，保持内心稳定。",
    "典故": "孔明求寿的故事，最后寿终正寝，提醒人们应修身自省。",
    "运势": "一切想结束之大事，均有所不宜"
  }
]
